{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "alabaster.nvim": {
      "src": "https://github.com/p00f/alabaster.nvim"
    },
    "alpha-nvim": {
      "src": "https://github.com/goolord/alpha-nvim"
    },
    "async.nvim": {
      "src": "https://github.com/lewis6991/async.nvim"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "clangd_extensions.nvim": {
      "src": "https://github.com/p00f/clangd_extensions.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "cmp-rg": {
      "src": "https://github.com/lukas-reineke/cmp-rg"
    },
    "cmp_luasnip": {
      "src": "https://github.com/saadparwaiz1/cmp_luasnip"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "diaglist.nvim": {
      "src": "https://github.com/onsails/diaglist.nvim"
    },
    "difft.nvim": {
      "src": "https://github.com/ahkohd/difft.nvim"
    },
    "editorconfig-vim": {
      "src": "https://github.com/editorconfig/editorconfig-vim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "github-nvim-theme": {
      "src": "https://github.com/projekt0n/github-nvim-theme"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "go.nvim": {
      "src": "https://github.com/ray-x/go.nvim.git"
    },
    "gruber-darker.nvim": {
      "src": "https://github.com/blazkowolf/gruber-darker.nvim"
    },
    "guihua.lua": {
      "src": "https://github.com/ray-x/guihua.lua.git"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon",
      "version": "'harpoon2'"
    },
    "headlines.nvim": {
      "src": "https://github.com/lukas-reineke/headlines.nvim"
    },
    "jj-diffconflicts": {
      "src": "https://github.com/rafikdraoui/jj-diffconflicts"
    },
    "kanagawa.nvim": {
      "src": "https://github.com/rebelot/kanagawa.nvim"
    },
    "leap.nvim": {
      "src": "https://codeberg.org/andyg/leap.nvim"
    },
    "lsp_signature.nvim": {
      "src": "https://github.com/ray-x/lsp_signature.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine-lsp-progress": {
      "src": "https://github.com/arkav/lualine-lsp-progress"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "luasnip-snippets": {
      "src": "https://github.com/mireq/luasnip-snippets"
    },
    "lush.nvim": {
      "src": "https://github.com/rktjmp/lush.nvim"
    },
    "mellifluous.nvim": {
      "src": "https://github.com/ramojus/mellifluous.nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-dap-go": {
      "src": "https://github.com/leoluz/nvim-dap-go"
    },
    "nvim-dap-python": {
      "src": "https://github.com/mfussenegger/nvim-dap-python"
    },
    "nvim-dap-ui": {
      "src": "https://github.com/rcarriga/nvim-dap-ui"
    },
    "nvim-dap-virtual-text": {
      "src": "https://github.com/theHamsta/nvim-dap-virtual-text"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lsp-endhints": {
      "src": "https://github.com/chrisgrieser/nvim-lsp-endhints"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig.git"
    },
    "nvim-nio": {
      "src": "https://github.com/nvim-neotest/nvim-nio"
    },
    "nvim-solarized-lua": {
      "src": "https://github.com/ishan9299/nvim-solarized-lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'c82bf96f0a773d85304feeb695e1e23b2207ac35'"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "opencode.nvim": {
      "src": "https://github.com/NickvanDyke/opencode.nvim"
    },
    "oxocarbon.nvim": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rose-pine": {
      "src": "https://github.com/rose-pine/neovim"
    },
    "rustaceanvim": {
      "src": "https://github.com/mrcjkb/rustaceanvim",
      "version": "9.0.0 - 10.0.0"
    },
    "salt-vim": {
      "src": "https://github.com/vmware-archive/salt-vim"
    },
    "schemastore.nvim": {
      "src": "https://github.com/b0o/schemastore.nvim"
    },
    "smart-splits.nvim": {
      "src": "https://github.com/mrjones2014/smart-splits.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "snipe.nvim": {
      "src": "https://github.com/leath-dub/snipe.nvim"
    },
    "solarized8": {
      "src": "https://github.com/lifepillar/vim-solarized8"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "typescript-tools.nvim": {
      "src": "https://github.com/pmizio/typescript-tools.nvim"
    },
    "undotree": {
      "src": "https://github.com/mbbill/undotree"
    },
    "uv.nvim": {
      "src": "https://github.com/benomahony/uv.nvim"
    },
    "vclib.nvim": {
      "src": "https://github.com/algmyr/vclib.nvim"
    },
    "vcsigns.nvim": {
      "src": "https://github.com/algmyr/vcsigns.nvim"
    },
    "vesper.nvim": {
      "src": "https://github.com/datsfilipe/vesper.nvim"
    },
    "vim": {
      "src": "https://github.com/dracula/vim"
    },
    "vim-dirdiff": {
      "src": "https://github.com/will133/vim-dirdiff"
    },
    "vim-fugitive": {
      "src": "https://github.com/tpope/vim-fugitive"
    },
    "vim-jjdescription": {
      "src": "https://github.com/avm99963/vim-jjdescription"
    },
    "vim-jsonnet": {
      "src": "https://github.com/google/vim-jsonnet"
    },
    "vim-test": {
      "src": "https://github.com/vim-test/vim-test"
    },
    "vim-zoom": {
      "src": "https://github.com/dhruvasagar/vim-zoom"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "zenbones": {
      "src": "https://github.com/zenbones-theme/zenbones.nvim"
    }
  }
}
